package com.dx.facade.enums;

import com.dx.enums.I18nEnum;

/**
 * report-server 国际化枚举
 */
public enum ReportI18CodeEnum implements I18nEnum {
    // 非本人锁单，操作失败
    非本人锁单(300071),
    //一审二审不能为同一人
    AUDIT_SAME_OPERATOR(310060),
    //佣金记录还有没锁定
    佣金记录还有没锁定(310061),
    //佣金记录还有没锁定
    佣金记录已经审核过(310062),
    //佣金收付异常
    佣金收付异常(310063),
    //交易金额不能小于等于0
     交易金额不能小于等于0(310064),
    LOCK_ORDER_EXSIT_ERROR(310064),//你有锁定的订单未处理,锁单失败
    //最大跨度为92天
    最大跨度为92天(300070),
    系统审核(311001),//系统审核
    升级礼金(311002),//升级礼金
    生日礼金(311003),//生日礼金
    上半月红包(311004),//上半月红包
    下半月红包(311005),//下半月红包
    游戏返水(311006),//游戏返水

    //佣金支付账变备注
    平台转入_平台转入(311007),
    平台转入_期佣金(311008),
    上级转入_上级转入(311009),
    上级转入_期佣金(3110010),
    转给下级_转给(3110011),
    转给下级_期佣金(3110012),

    //审核
    一审(3110013),
    二审(3110014),
    至(3110015),
    ;

    private int code;

    ReportI18CodeEnum(int code) {
        this.code = code;
    }

    @Override
    public int getCode() {
        return code;
    }
}
